goguryeo = {
    "태조왕": [
        "옥저를 복속한 왕",
        "계루부 고씨가 왕위 세습한 왕",
        "요동 지방 진출을 노린 왕"
    ],
    "미천왕": [
        "낙랑군을 격퇴해 중국 세력을 몰아낸 왕"
    ],
    "소수림왕": [
        "고구려 불교를 공인한 왕",
        "고구려 율령을 반포한 왕",
        "중앙에는 태학, 지방에는 경당을 설치한 왕"
    ],
    "광개토대왕": [
        "한강 이북 지역까지 차지한 왕",
        "신라를 도와 왜군을 격퇴, 가야까지 공격한 왕",
        "연호 영락을 사용한 왕",
        "요동, 만주를 장악한 왕"
    ],
    "장수왕": [
        "남진 정책을 실시한 왕",
        "국내성에서 평양으로 천도한 왕",
        "고구려 한강 유역을 장악한 왕 (백제는 웅진으로 천도)",
        "고구려 전성기의 왕",
        "백제의 개로왕을 죽인 왕",
        "중국 남조, 북조와 등거리 외교를 한 왕",
        "광개토대왕릉비를 건립한 왕",
        "충주고구려비를 건립한 왕"
    ],
    "영류왕": [
        "살수대첩에서 승리한 왕 (612)"
    ],
    "보장왕": [
        "연개소문의 정변으로 영류왕 사망, 연개소문이 권력 장악을 하던 왕",
        "당의 위협을 받아 천리장성을 축조한 왕",
        "안시성에서 당의 군을 격퇴한 왕 (645)"
    ]
}

baekjae = {
    "고이왕": [
        "백제 한강 유역을 장악한 왕",
        "한 군현과 항쟁한 왕"
    ],
    "근초고왕": [
        "마한을 복속한 왕",
        "고구려의 평양을 공격하여, 황해도(중국-백제-가야-왜를 연결하는 해상 교역로) 일대까지 진출한 왕",
        "평양성에서 고국원왕을 살해한 왕",
        "백제 전성기의 왕"
    ],
    "침류왕": [
        "백제 불교를 공인한 왕"
    ],
    "문주왕": [
        "한성에서 웅진으로 천도한 왕 (475)"
    ],
    "동성왕": [
        "백제와 신라 사이의 동맹을 강화하는 혼인동맹 정책을 실시한 왕",
        "중국 남조와 국교를 재개한 왕"
    ],
    "무령왕": [
        "지방의 22담로에 왕족을 파견하여 지방 통제를 강화한 왕"
    ],
    "성왕": [
        "웅진에서 사비로 천도한 왕 (538)",
        "중앙 관청을 22부로 확대하고, 수도 5부, 지방 5방으로 정비한 왕",
        "신라와 함께 한강 하류를 일시 회복한 왕",
        "백제의 배신으로 한강 하류를 빼앗겨 전쟁 중 전사한 왕"
    ],

    "오경박사": [
        "백제에서 유학 경전에 능통한 사람"
    ]
}

shilla = {
    "내물왕": [
        "김씨가 왕위 세습을 한 왕",
        "이사금에서 마립간으로 칭호를 변경한 왕",
        "고구려 광개토대왕의 도움으로 왜군을 격퇴한 왕 (호우명 그릇이 증거)",
        "한동안 고구려의 간섭을 받은 왕"
    ],
    "지증왕": [
        "우경과 수리 사업을 장려한 왕",
        "국호와 왕호를 각각 신라와 왕으로 변경한 왕",
        "전국의 행정 구역을 정비한 왕 (중국 체제 도입)",
        "이사부를 보내 우산국을 복속한 왕"
    ],
    "법흥왕": [
        "신라 불교를 공인한 왕",
        "신라 율령을+ 반포한 왕",
        "금관가야를 흡수한 왕",
        "낙동강을 확보한 왕"
    ],
    "진흥왕": [
        "화랑도를 국가적 조직으로 개편한 왕",
        "신라 한강 유역을 장악한 왕",
        "신라 전성기의 왕",
        "대가야를 정복한 왕",
        "순수비 4개를 건립한 왕",
        "단양 신라 적성비 건립한 왕"
    ],

    "임신서기석": [
        "신라의 청년들이 유학을 공부한 사실이 나타나 있는 비석"
    ],

    "진흥왕순수비": [
        "신라의 유학 경전 내용이 인용된 비석"
    ]
}

unifiedSilla = {
    "무열왕": [
        "진골 최초의 왕",
        "통일 신라의 중대 전성기를 연 왕",
        "백제를 멸망시킨 왕"
    ],
    "문무왕": [
        "통일을 완수한 왕"
    ],
    "신문왕": [
        "김흠돌의 난이 일어난 왕",
        "진골들을 숙청하기 시작한 왕",
        "통일 신라 왕권강화 정책을 펼친 왕+"
    ],

    "연맹체": [
        "초기 국가는 5부족 또는 6부족 ooo중심으로 형성되었다."
    ],

    "자치적": [
        "초기 국가의 부족들은 ooo성격을 띄었다."
    ],

    "행정적": [
        "중앙 집권적 고대 국가 로 넘어가면서 각 부는 ooo성격을 띄었다."
    ],

    "중앙": [
        "각 부의 지배 세력은 oo귀족 으로 전환 되었다."
    ],

    "관등제": [
        "관제 정비를 위해 ooo을 마련하였다."
    ],

    "공복": [
        "관제 정비를 위해 oo을 제정 하였다."
    ],

    "귀족": [
        "부 대표 회의를 oo회의 라고 불렀다."
    ],

    "지방관": [
        "활발한 정복 활동을 통해 지방 행정 조직을 정비하였다 이로 인해 지방에 ooo을 파견하였다."
    ], 

    "군사지휘관": [
        "지방관은 ooooo을 겸하였다."
    ],

    "군사적": [
        "지방관은 ooo성격이 강하였다."
    ],

    "율령": [
        "늘어난 주민을 효율적으로 관리 하기위해 oo을 반포 하였다."
    ],

    "불교": [
        "왕권강화, 정신적 통합을 이루기 위해 oo을 공인 하였다."
    ],

    "왕즉불": [
        "“왕이 곧 부처다” 인 사상은?"
    ],

    "제가회의": [
        "고구려의 귀족 회의 명칭은?"
    ],

    "정사암회의": [
        "백제의 귀족 회의 명칭은?"
    ],

    "화백회의": [
        "신라의 귀족 회의 명칭은?"
    ],

    "고이왕": [
        "백제: 3c 중앙 집권적 통치체제를 마련하고 한강유역을 장악했다. 이때 왕의 이름은?"
    ],

    "근초고왕": [
        "백제: 4c 마한을 복속 시키고 황해도 일대를 진출 하였으며 해상교역로를 확보해 대외 교류를 활발하게 하였다 이때 왕의 이름은?"
    ],

    "침류왕": [
        "백제: 4c 불교를 수용하였다. 이때 왕의 이름은?"
    ],

    "무령왕": [
        "백제: 6c 지방의 22담로에 왕족을 파견하여 통제를 강화한 왕의 이름은?"
    ], 

    "성왕": [
        "백제: 6c 사비천도와 체제를 정비함 (중앙을 22부 지방을 5부 5방 으로 정비 하였고) 한강 하류를 “일시” 회복 했다. 이때 왕의 이름은?"
    ],

    "태조왕": [
        "고구려: 1c 옥저를 복속시키고 계루부 고씨의 왕위 세습 독점 기반을 마련 하였다. 이때 왕의 이름은?"
    ],

    "소수림왕": [
        "고구려: 4c 율령을 반포하고 불교를 공인 하였으며 유교교육 기관인 태학을 설립 하였다. 이때 왕의 이름은?"
    ],

    "광개토대왕": [
        "고구려: 4c 백제를 압박하고 신라를 도와 왜군을 격퇴하였다. 요동과 만주를 장악 하였다. 이때 왕의 이름은?"
    ],

    "장수왕": [
        "고구려 : 5c 남북조와 등거리 외교를 하였고 남진 정책과 평양 천도를 하였고 한강을 차지 하였다. 이때 왕의 이름은?"
    ], 

    "수 당": [
        "고구려를 6c 때 처들어온 나라의 이름 2개를 말하세요."
    ],

    "살수대첩": [
        "6c 고구려가 수 나라와 싸워 크게 이긴 전투의 이름은?"
    ],

    "안시성": [
        "6c 고구려에 당 나라가 처들어 왔을때 어디에서 격퇴 하였나요?"
    ],

    "연개소문": [
        "수.당과 전쟁 할때 집권자는 누구였나요?"
    ],

    "내물왕": [
        "신라: 4c 김씨 왕위 세습을 마련 이사금에서 마립간이라는 칭호로 바꾸었으며 고구려의 도움으로 왜군을 격퇴한 왕의 이름은?"
    ],

    "지증왕": [
        "신라: 6c 우경을 장려하였고 ‘신라’ 국호 사용 ‘왕’ 왕호 사용 우산국에 이사부를 보내 복속시킨 왕의 이름은?"
    ],

    "법흥왕": [
        "신라: 6c 율령을 반포 하였고 불교를 수용하였으며 금관가야를 흡수하고 낙동강을 확보한 왕의 이름은?"
    ],

    "진흥왕": [
        "신라: 6c 화랑도를 개편하고 한강유역을 차지 하였으며 대가야를 정복 함경도 까지 진출 하였고 적성비와 순수비를 건립한 왕의 이름은?"
    ], 

    "당": [
        "7c 신라는 삼국통일 과정에서 o와(과) 손을 잡았다."
    ],

    "660년": [
        "백제가 멸망한 연도는?"
    ],

    "668년": [
        "고구려가 멸망한 연도는?"
    ],

    "676년": [
        "삼국통일을 완수한 연도는 ?"
    ],

    "매소성 기벌포": [
        "신라가 당과의 전투에서 2번 승리 하였는데 이때 승리한 전투를 말하시오"
    ],

    "외세": [
        "신라는 삼국통일 과정에서 oo 지원을 받았다."
    ],

    "대동강": [
        "신라는 삼국통일 과정에서 ooo이남 지역만 확보 하였다."
    ],

    "무력": [
        "신라는 당을 oo으로 물리쳤다."
    ],

    "기틀": [
        "신라는 삼국의 문화를 융합하여 민족 문화의 oo을 마련하였다."
    ],

    "집사부": [
        "통일 신라: 기밀사무와 왕명을 수행하는 부는?"
    ], 

    "사정부": [
        "통일 신라: 관리의 비리를 감찰하는 부는?"
    ],

    "국학": [
        "통일 신라의 유교 교육 기관의 명칭은?"
    ],

    "관료전 녹읍": [
        "통일 신라때 귀족 경제력을 약화 시키기 위해 ooo 을 지급 하고 oo 을 폐지 하였다."
    ],

    "9주 5소경": [
        "통일 신라의 지방행정 체제는?"
    ],

    "왕권": [
        "통일 신라 말 진골 귀족의 대대적인 반란으로 oo이 약화 되었다."
    ],

    "상대등": [
        "진골 세력이 강화되어 귀족대표인 ooo의 정치적 위상이 강화 되었다."
    ],

    "향락": [
        "진골 귀족은 개인농장, 노비, 군사를 늘리고 세력을 확대하면 사치와 oo을 즐겼다."
    ],

    "6두품": [
        "유교사상을 바탕으로 골품제 사회의 문제점을 비판하고 개혁을 주장하였다. 또한 반 신라적인 태도를 드러냈다.",
        "통일 신라: 행정 실무 담당과 왕의 정치적 조언자였다."
    ],

    "농민": [
        "가혹한 수취에 시달려 노비나 초적(도적)으로 전락 하고 전국 곳곳에 oo봉기가 발생하였다."
    ],

    "호족": [
        "중앙 정부의 통제가 약화되어 지방에서 독자적인 세력이 생겨났는데 이들을oo 이라고 불렀다."
    ],

    "성 백성": [
        "호족은 근거지에 o을 쌓고 군대를 기르며 oo을 실질적으로 통치 하였다."
    ],

    "완산주 후백제": [
        "견훤은 ooo에서 ooo 를 건국하였다."
    ],

    "송악 후고구려": [
        "궁예는 oo에서 oooo를 건국하였다."
    ],

    "후삼국": [
        "후백제 , 후고구려가 생겨나면서 ooo으로 분열 되었다."
    ],

    "동모산 발해": [
        "대조영은 ooo에서 oo건국 하였다."
    ],

    "말갈": [
        "발해를 건국할때 고구려 유민과 oo족 들과 건국하였다."
    ],

    "장문휴 산둥반도": [
        "무왕은 당과 무려으로 대결하였으며 (ooo을 보내 당의 oooo를 공격하였다.)"
    ], 

    "3 6": [
        "문왕은 당과 친선관계를 맺었으며 o성 o부의 중앙 체제를 정비하였다 또한 여기에는 유교이념이 반영되었다. "
    ],

    "선왕": [
        "요동,연해주 진출 5경 15부 62주의 지방 행정 체제를 성립하고 (‘해동성국’)이라는 칭호를 얻었다. 이때 왕의 이름은?"
    ],

    "거란": [
        "발해는 지배층의 내분과 oo 의 공격으로 멸망하였다."
    ],

    "대광현": [
        "발해의 왕자 ooo은 고려에 망명하였다."
    ],

    "황제국": [
        "발해는 연호를 사용 하였으며  왕을 ‘황상’ 이라고 부르는 등 ooo을 자처 하였다."
    ],

    "국학 경당": [
        "고구려는 소수림왕때 중앙에 유교 교육 기관인 oo 을 세우고 지방에는 oo 을 세웠다."
    ],

    "오경박사": [
        "백제는 유학경전에 능통한 oooo제도 와 일본에도 유학을 전수하였다."
    ],

    "임신서기석": [
        "신라는 ooooo에 유학을 공부한 사실이 기록 되어있고 진흥왕 순수비에 유학경전이 인용되었다."
    ],

    "국학 독서삼품과": [
        "통일 신라는 유교 교육 기관인 oo을 설립 6두품 유학자의 역할이 확대 되었으며 ooooo를 실시 하였다."
    ],

    "주자감": [
        "발해는 유교 덕목을 중앙 관서의 명칭으로 사용하였으며 ooo에서 유학을 교육하였다."
    ],

    "원효": [
        "통일 신라: 일심사상, 아미타 신앙, 노래로 전파한 승려"
    ],

    "의상": [
        "통일 신라: 화엄사상, 관음신앙, 통합과 조화를 강조한 승려"
    ], 

    "선종": [
        "신라하대때 기존의 교종 불교 대신 oo불교가 유행하였다."
    ], 

    "경전 교리": [
        "교종은 oo과 oo 의 이해를 중시함"
    ],

    "실천 참선": [
        "선종은 oo과 oo통한 꺠달음을 추구함"
    ],

    "9산선문": [
        "신라하대 호족세력을 통해 교세를 확장 하였는데 9산에 만들었다하여 oooo 이라고 불렸다."
    ],

    "도교": [
        "불로장생. 신선이 되기를 추구하고 토착신앙과 결합하였다. 고구려: 사신도 백제: 금동대향로, 산수무늬 벽돌 에 반영됨"
    ],

    "풍수지리": [
        "자연환경이 국가와 사람의 운명에 영향을 준다고 믿었고 예언적인 도참사상과 결합 하였다."
    ],
}

goryeo = {
    "태조": [
        "호족 포용정책과 고구려 계승의식으로 북진정책을 추진하고 서경을 중시한 왕의 이름은? "
    ],

    "광종": [
        "호족 견제 정책인 노비 안검법 실시 과제와 공복을 제정한 왕의 이름은 "
    ],

    "성종": [
        "통치제제를 최승로 의 시무 28조를 받아 들여 2성 6부로 관제함 주요거점에 12목을 설치하고 지방관을 파견함 또한 국자감과 향교를 설립한 왕의 이름은? "
    ],

    "2성6부": [
        " 고려의 중앙 통치 체제는 "
    ],

    "5도양계": [
        "고려의 지방 통치 체제는 "
    ],

    "중서문하성": [
        "고려의 최고의 중앙 관서 이자 국정 총괄기구는? "
    ],

    "상서성": [
        "고려의 정책 집행하는 기구는? "
    ],

    "중추원": [
        "고려의 군사 기밀, 왕명 출납하는 기구는? "
    ],

    "대간": [
        "고려의 어사대 + 중서문하성의 낭사 간쟁, 봉박, 서경등의 권리를 행사 "
    ],

    "도병마사": [
        "고려의 국방문제를 담당하는 기구 "
    ],

    "식목도감": [
        "고려의 법률, 제도 제정 하는 기구 "
    ],

    "합의제": [
        "도병마사와 식목도감은 고려만의 독자적인 기구로, 재신, 추밀의 ooo 으로 운영됨 "
    ],

    "지방관": [
        "고려의 지방 세력이 강하여 한동안 ooo을 파견하지 않음 "
    ],

    "향리": [
        "지방 세력중 일부는 oo으로 전환 "
    ],

    "5도": [
        "oo 은 일반 행정구역으로 (군현 + 향,부곡, 소) 이루어짐 "
    ],

    "주현 속현": [
        "군현은 지방관이 파견된 oo 과 파견되지 않은 oo 으로 나눠짐. "
    ],

    "주현": [
        "고려 초기에는 속현이 많았으나 후대로 가면서 점점 oo이 많아짐 "
    ],

    "양계": [
        "oo은 군사 행정 구역으로, 진 설치 함 "
    ],

    "국자감 향교": [
        "고려의 교육제도 개경에는 ooo 지방에는 oo 을 세움 "
    ],

    "과거제 음서": [
        "고려의 관리 선발 제도에는 ooo와 oo이 있었다. "
    ],

    "문관 기술관": [
        "과거제 에는 중앙 관리나 향리의 자제가 응시하던 oo 과 일반 백성도 응시가 가능한 ooo있었다. "
    ],

    "공신 5": [
        "음서는 oo이나 o품 이상의 관리의 자손이 과거를 거치지 않고 관직에 나갈수 있는 제도이다. "
    ],

    "서희 강동6주": [
        "고려는 거란의 1차 침략때 oo의 외교 담판으로 oooo를 획득하였다. "
    ],

    "외교": [
        "고려는 거란의 2차 침략때 개경이 함락 당하지만 oo으로 극복하였다. "
    ],

    "귀주대첩": [
        "고려는 거란의 3차 침략때 감강찬이 거란군을 격퇴 하였는대 이때 크게 이긴 싸움의 이름은?"
    ],

    "천리장성": [
        "고려는 거란의 침략때 결과적으로 oooo을 축조 하였고 국방을 강화하였으며 한동안 고려-송-요 세력 균형을 이루었다. "
    ],

    "문벌": [
        "고려전기 중기때 신라말 호족과 6두품 출신이 고려의 새로운 지배층을 형성하였는데 이를 뭐라고 불렀을까? "
    ],

    "과거 음서": [
        "문벌은 주로 oo과 oo 을 통해 관직에 진출 하였다. "
    ],

    "인종": [
        "이자겸은 oo가 제거 시도 하였다. "
    ],

    "왕실": [
        "이자겸의 난 으로 인해 문벌사회의 분열이 심화되고 oo권위가 약화 되었다. "
    ],

    "서경 천도": [
        "인종과 정지상 등 oo세력이 oo을(를) 주장 하였다. "
    ],

    "김부식": [
        "묘청의 서경 천도운동은 결국 좌절 되어  서경에서 반란을 일으켰는데 ooo에게 진압 당하였다. "
    ],

    "윤관 별무반": [
        "12c 초 여진이 국경을 침범 해왔지만 oo이 ooo을 이끌고 여진을 정벌 하러갔다. "
    ],

    "척경입비도": [
        "동북지방에 9개의 성을 쌓는 모습을 그린 그림의 이름은? "
    ],

    "금요": [
        "여진은 o 을 세우고 o을 멸망 시켰다. "
    ],

    "군신관계": [
        "여진은 고려에 oooo를 요구 하였다. "
    ],

    "이자겸": [
        "ooo은 정권 유지를 위해 금의 군신관게를 받아드렸다. "
    ],

    "북진정책": [
        "군신관계를 받아드림으로써 oooo에 큰 타격을 입었다. "
    ],

    "무신정변": [
        "문벌의 모순이 심화되고, 무신을 차별하면서 oooo이 반발 하였고 무신 정권이 성립 하였다. "
    ],

    "중방": [
        "무신의 회의기구인 oo을 통해 국정을 장악 하였다. "
    ],

    "교정도감": [
        "최충헌은 국정총괄 기구인 oooo을 설치하였다. "
    ],

    "도방": [
        "최씨 무신 정권 때 사병을 확대 하였다 이때 사병을 부르는 말은? "
    ],

    "정방": [
        "최우는 이것을 설치하여 인사권을 장악하고 문신을 등용하였다. "
    ],

    "강화도": [
        "몽골의 친입으로 ooo로 천도 하였다. "
    ],

    "관청": [
        "원의 부마국으로 전락 하면서 왕실과 oo이 격하되었다. "
    ],

    "쌍성총관부": [
        "내정 간섭과 공물 요구 공녀를 요구하고 영토를 강제 지배 하였다 (ooooo, 동녕부, 탐라촌관부)  ",
        "반원 정책으로 ooooo를 공격하여 철령 이북 영토를 회복함"
    ],

    "정동행성": [
        "일본 원정에 실패하자 oooo을 내정 간섭 기구로 사용하였다. "
    ],

    "권문세족": [
        "원과 관계를 맺은 세력은?",
        "반원 개혁 정치 oooo 을 숙청함 "
    ],

    "도평의사사": [
        "원 간섭기때 권문세족은 ooooo를 장악했다.",
        "고려만의 통치체제 도병마사가 개편된 기구는?"
    ],

    "사신": [
        "13세기초 몽골은 oo의 죽음을 구실로 쳐들어옴 "
    ],

    "김윤후": [
        "민주항전: 처인성에서 ooo이 몽골장수 살리타를 사살함 "
    ],

    "충주성": [
        "민주항전: ooo 에서 노비들이 몽골군 격퇴 "
    ],

    "강화": [
        "몽골 친입의 고통 + 최씨 정권 수탈 = 몽골과의 oo을 추친함 "
    ],

    "삼별초항쟁": [
        "몽골과의 강화를 반대하여 봉기를 이르켰는데 이를 뭐라고 할까요? "
    ],

    "정동행성이문소": [
        "반원 정책으로 ooooooo를 폐지함 "
    ],

    "승려신돈": [
        "신돈등용으로 oo oo을 등용함 "
    ],

    "전민변정도감": [
        "빼앗긴 농민의 토지를 돌려주는 기구인 oooooo을(를) 설치 "
    ],

    "홍건적왜구": [
        "공민왕때 ooo와(과) oo이(가) 친입해옴 "
    ],

    "이성계": [
        "14세기 후반 홍건적과 왜구 침략 과정에서 ooo등의 세력이 두각을 드러냄 "
    ],
    "조선": [
        "정도전 등 일부 신진 사대부와 손을 잡고 oo건국 (1392) "
    ],

    "효심의난": [
        "무신정권 집권자가 정중부, 이의방, 경대승, 이의민 이였을때 oo의 난이 일어남 "
    ],

    "만적": [
        "무신정권 집권자가 최충헌 이었을때 oo의 난이 일어남 이는 왕후장상의 씨는 따로없고, 신분의 해방을 추구하였음  "
    ],

    "몽골풍": [
        "공민왕의 반원 정책으로 격하된 관제를 회복하고 ooo금지 시킴 "
    ],

    "성리학": [
        "고려의 사상으로 원간섭기에 받아들인 사상이다 신진사대부는 ooo을 기반으로 불교를 비판 하였다. "
    ],

    "의천": [
        "고려의  교종 중심으로 교관겸수와 해동 천태종을 창시한 승려는?"
    ],

    "지눌": [
        "고려의 선종 중심으로 돈오점수, 정혜쌍수 수선사 결사 운동을 한 승려는?"
    ],

    "유불일치설": [
        "혜심은 ooooo을 주장하였다. "
    ],

    "요세": [
        "백련결사를 결성하였다. "
    ],
}

joseon = {
    "과전법": [
        "   조선의 건국 과정 -> 위화도 회군 -> ooo 실시 -> 조선건국 빈칸에 들어간 법은?"
    ], 

    "6조직계제": [
        "6조가 의정부를 거치지 않고 곧바로 국왕에게 업무 보고하는 체제는?"
    ], 

    "의정부서사제": [
        "6조가 의정부에 업무를 보고하면 이를 심의후 국왕에게 보고하는 체제는?"
    ],

    "경국대전": [
        "조선 왕조의 기본 법전인 oooo 편찬 시작"
    ], 

    "성종": [
        "경국대전을 반포하기 시작한 왕은?"
    ], 

    "의정부": [
        "조선의 재상의 합의기구, 국정을 총괄하는 기구"
    ],

    "6조": [
        "조선의 정책 집행하는 기구인"
    ],

    "홍문관 사헌부 사간원": [
        "조선의 언론 활동을 담당하는 기구"
    ],

    "의금부": [
        "조선의 사법기구"
    ], 

    "춘추관": [
        "조선의 역사 편찬 하는 기구"
    ], 

    "한성부": [
        "조선의 서울 행정 담당하는 기구"
    ], 

    "승정원": [
        "조선의 왕의 비서 기구"
    ], 

    "성균관": [
        "조선의 최고 교육 기관"
    ], 

    "능력": [
        "조선의 관리선발은 대부분 과거를 통해 선발 하고 개인의 oo 을 중시함"
    ], 

    "서경": [
        "조선은 인사 관리의 공정성 확보를 통해 5품이하의 관리 임명 시 oo을 거치도록함"
    ],

    "상피제": [
        "조선은 권력의 집중과 부정을 방지하기 위해 ooo을 시행함"
    ], 

    "8도": [
        "조선의 지방 행정 체제는 전국을 oo으로 나누었다"
    ], 

    "관찰사": [
        "각 도에 파견되었고 도의 행정을 총괄하여 관할 지역의 수령을 지휘, 감독"
    ],

    "수령": [
        "모든 군현에 파견 되었고 국왕의 대리인으로 행정, 사법, 군사권을 행사."
    ], 

    "유향소": [
        "지방 사족이 조직한 향촌 자치 기구로 수령을 보좌하거나 견제함"
    ],   
}